Hexa_Trigram = {
    (0,0):'乾为天',(1,0):'泽天夬',(2,0):'火天大有',(3,0):'雷天大壮',
    (4,0):'风天小畜',(5,0):'水天需',(6,0):'山天大畜',(7,0):'地天泰',
    (0,1):'天泽履',(1,1):'兑为泽',(2,1):'火泽睽',(3,1):'雷泽归妹',
    (4,1):'风泽中孚',(5,1):'水泽节',(6,1):'山泽损',(7,1):'地泽临',
    (0,2):'天火同人',(1,2):'泽火革',(2,2):'离为火',(3,2):'雷火丰',
    (4,2):'风火家人',(5,2):'水火既济',(6,2):'山火贲',(7,2):'地火明夷',
    (0,3):'天雷无妄',(1,3):'泽雷随',(2,3):'火雷噬嗑',(3,3):'震为雷',
    (4,3):'风雷益',(5,3):'水雷屯',(6,3):'山雷颐',(7,3):'地雷复',
    (0,4):'天风姤',(1,4):'泽风大过',(2,4):'火风鼎',(3,4):'雷风恒',
    (4,4):'巽为风',(5,4):'水风井',(6,4):'山风蛊',(7,4):'地风升',
    (0,5):'天水讼',(1,5):'泽水困',(2,5):'火水未济',(3,5):'雷水解',
    (4,5):'风水涣',(5,5):'坎为水',(6,5):'山水蒙',(7,5):'地水师',
    (0,6):'天山遁',(1,6):'泽山咸',(2,6):'火山旅',(3,6):'雷山小过',
    (4,6):'风山渐',(5,6):'水山蹇',(6,6):'艮为山',(7,6):'地山谦',
    (0,7):'天地否',(1,7):'泽地萃',(2,7):'火地晋',(3,7):'雷地豫',
    (4,7):'风地观',(5,7):'水地比',(6,7):'山地剥',(7,7):'坤为地'
}


def Change(Trigram,Change_Yao) :
    if Change_Yao == 1:
        if Trigram % 2 != 0 :
            Trigram += 1
        else :
            Trigram -= 1
    elif Change_Yao == 2 :
        if Trigram in [1,2,5,6] :
            Trigram += 2 
        else :
            Trigram -= 2
    else :
        if Trigram <= 4 :
            Trigram += 4
        else :
            Trigram -= 4
    return Trigram
